In [1]:
import pandas as pd
import numpy as np
import math
import matplotlib.pyplot as plt

In [2]:
test = pd.read_csv('csvs/test_scores.csv')
test

     name  math  cs
0   david    92  98
1   laura    56  68
2  sanjay    88  81
3     wei    70  80
4    jeff    80  83
5   aamir    49  52
6  venkat    65  66
7   virat    35  30
8  arthur    66  68
9    paul    67  73

In [44]:
x = test['math'].values
y = test['cs'].values
m = len(test['math'])
x

array([92, 56, 88, 70, 80, 49, 65, 35, 66, 67], dtype=int64)

In [43]:
theta0 = 0
theta1 = 0
learning_rate = 0.01
squared_error = sum([val**2 for val in [(theta0 + theta1*x)-y]])
squared_error

array([9604, 4624, 6561, 6400, 6889, 2704, 4356,  900, 4624, 5329],
      dtype=int64)

In [36]:
cost

0    480.20
1    231.20
2    328.05
3    320.00
4    344.45
5    135.20
6    217.80
7     45.00
8    231.20
9    266.45
dtype: float64

In [ ]:
su